#+TITLE: Baccam Model — Grey-box Recovery with Sampling Design Exploration
#+AUTHOR: Ramakrishna Suresh
#+PROPERTY: header-args:julia-vterm :session *julia* :results output :exports both :dir (projectile-project-root) :tangle yes :comments both
#+STARTUP: inlineimages overview

** Saving the datasets

#+begin_src julia-vterm

for (label, cfg) in configs
    df = DataFrame(
        t      = cfg.t_obs,
        T_true = cfg.Y_true[1, :],
        I_true = cfg.Y_true[2, :],
        V_true = cfg.Y_true[3, :],
        T_mean = cfg.Y_mean[1, :],
        I_mean = cfg.Y_mean[2, :],
        V_mean = cfg.Y_mean[3, :],
    )
    CSV.write(
        joinpath(pwd(), "Results", "Baccam_$(label).csv"),
        df
    )
    println("Saved Baccam_$(label).csv  ($(cfg.n_tp) timepoints × $(cfg.n_mice) mice)")
end
#+end_src

#+RESULTS:
: Saved Baccam_C_20x6.csv  (20 timepoints × 6 mice)
: Saved Baccam_B_10x12.csv  (10 timepoints × 12 mice)
: Saved Baccam_A_5x24.csv  (5 timepoints × 24 mice)

* Visualising the fits for each configuration

The state MLP predicts in log₁₀-transformed coordinates. We use
~inverse_state~ from ~Transforms.jl~ to map predictions back to raw biological
units for plotting.

#+begin_src julia-vterm

fig = Figure(size = (1200, 700), fontsize = 12)

state_labels = ["Target T(t)", "Infected I(t)", "Virus V(t)"]
config_labels_short = ["A: 5×24", "B: 10×12", "C: 20×6"]
config_keys  = ["A_5x24", "B_10x12", "C_20x6"]

for (col, key) in enumerate(config_keys)
    r   = results[key]
    res = r.res
    cfg = r.cfg

    # Evaluate state MLP on a dense grid (returns log₁₀-transformed coords)
    smodel = state_model(res.params, res.ctx2)
    t_eval = permutedims(Float32.(range(t_span[1], t_span[2]; length = 300)))
    ŷ_transformed = smodel(t_eval)

    # Invert the log₁₀ transform to recover raw biological concentrations
    ŷ_real = inverse_state(state_transform, ŷ_transformed)

    for row in 1:3
        ax = Makie.Axis(
            fig[row, col];
            title  = col == 1 ? state_labels[row] : "",
            xlabel = row == 3 ? "Days post-infection" : "",
            ylabel = col == 1 ? "Concentration" : "",
            yscale = Makie.pseudolog10,
            xgridvisible = true, ygridvisible = true,
            topspinevisible = false, rightspinevisible = false,
            xticklabelsize = 9, yticklabelsize = 9,
            titlesize = 11, titlealign = :left,
        )
        if row == 1
            Label(fig[0, col], config_labels_short[col];
                  fontsize = 13, tellwidth = false)
        end

        # True ODE (raw units)
        lines!(ax, t_fine, sol_array[row, :];
               color = :grey60, linewidth = 1.5, linestyle = :dash)

        # NN fit (inverted back to raw units)
        lines!(ax, vec(t_eval), ŷ_real[row, :];
               color = :black, linewidth = 2)

        # Training data (mouse-averaged, raw units)
        scatter!(ax, cfg.t_obs, cfg.Y_mean[row, :];
                 markersize = 7, color = :white,
                 strokecolor = :black, strokewidth = 1.5)
    end
end

Legend(fig[4, 1:3],
       [LineElement(color = :grey60, linewidth = 1.5, linestyle = :dash),
        LineElement(color = :black, linewidth = 2),
        MarkerElement(marker = :circle, markersize = 7, color = :white,
                      strokecolor = :black, strokewidth = 1.5)],
       ["True ODE", "NN(t, θ_u)", "Training data"],
       orientation = :horizontal, tellwidth = false)

display(fig)

# save(joinpath(pwd(), "Results", "Baccam_fits_comparison.pdf"), fig; px_per_unit = 600/72)
#+end_src

#+RESULTS:
: LoadError: KeyError: key "A_5x24" not found
: in expression starting at /tmp/babel-BPBHop/julia-vterm-src-UKRnoQ:8

